       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRIM-PROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-VALUE PIC 9(5).
       PROCEDURE DIVISION.
       DO-WORK.
           MOVE 42 TO WS-VALUE.
           DISPLAY WS-VALUE.
